org/lang/prolog.org
#+TITLE: Prolog
#+STARTUP: content
#+STARTUP: latexpreview
#+STARTUP: inlineimages
#+OPTIONS: toc:nil
#+HTML_MATHJAX: align: left indent: 5em tagside: left
#+BEGIN_HTML
---
layout: page
title: Prolog
---
#+END_HTML

* Prolog

Prolog ist eine dynamisch getypte Sprache. Prolog (dt. Programmieren in
Logik). Stadardisiert (ISO-)

Ein Prolog Programm ist eine Menge von /Fakten/ und /Regeln/ (auch
/Klauseln/ genannt) für Prädikate, wobei Prädikate Aussagen über Objekte
sind. Eine Aussage besteht aus einer Beschreibung der Eigenschaft (z.B.
"ist Primzahl") und beteiligten /Objekten/ (z.B. "3"). Aussage werden in
der /Standardpräfixschreibweise/ angegeben, z.B.
=name(objekt1, ..., objektn)= (Leerzeichen vor der öffnenden Klammer
sind nicht zulässig).

** Kommentare

=%=

** Atome

Atome sind unzerlegbare Prolog-Objekte. Atome beginnen mit einem
Kleinbuchstaben (danach sind weitere Kleinbuchstaben, Großbuchstaben,
Ziffern und einige Sonderzeichen zulässig).

** Vergleich von Atomen

-  Gleichheit: =⟨atom⟩ == ⟨atom⟩=
-  Ungleichheit: =⟨atom⟩ \= ⟨atom⟩=

** Frei Variablen

/Frei Variablen/ (auch /Logikvariablen/) sind Variablen, deren Werte
nach dem Schlussfolgerungsprinzip auf Basis der definierten Fakten
bestimmt werden. Freie Variablen beginnen mit einem Großbuchstaben und
können in Termen verwendet werden.

** Fakten

Fakten sind Aussagen, die beweisbar sind, also zu "wahr" ausgewertet
werden. Sie werden mit =.= und einem Whitespace (Leereichen oder
Zeilenvorschub) abgeschlossen. Fakten haben die Form:
=⟨Prädikat⟩(⟨Term⟩).=

** Regeln

Regeln sich Schlussfolgerungen der Form: "Wenn Aussage A wahr ist, dann
ist auch Aussage B wahr". Regeln werden ebenfalls mit =.= und einem
Whitespace (Leereichen oder Zeilenvorschub) abgeschlossen. =:-=
enspricht $\Longleftarrow$. =,= entspricht $\wedge$. =;= entspricht
$\vee$. Regeln haben die Form: =⟨Term⟩ :- ⟨Term⟩, ..., ⟨Term⟩.=

** Anonyme Variable

=_= ist die /anonyme (freie) Variablen/. Sie wird nicht gebunden und
bezeichnet bei mehrfacher Verwendung nicht denselben Wert. ALso steht
=[_,_,_]= für alle 3-elementigen Listen, deren Elemente identisch sind
oder nicht.

* Anfragen

In Anfragen können freie Variablen verwendet werden. Das Ergebnis von
Anfragen sind diejenigen /Objekte/, für die die Anfrage wahr wird. Die
Ausgabe einer Anfrage wird durch =false= oder =no= abgeschlossen.

* Strukturen

Strukturen bestehen aus einem /Funktor/ und /Komponenten/ (beliebe
Prolog-Objekte).

* Objekte

Objekte werden auch /Terme/ genannt. Terme bestehen aus:

-  Konstanten (Zahlen oder Atome)
-  Strukturen

* Listen

-  leere List: =[]=
-  =.= ist der Funktor zur Konstruktion einer Liste aus einem Element
   und einer Restliste, z.B. =.(x,xs)=

Kurzschreibweisen für Listen: * =[1,2,3]= * =[x|xs]=

-  Texte (Strings) sind Listen von ASCII-Werten (es gibt keinen Datentyp
   für Character)

*** Vordefinierte Prädikate für Listen

Aus =library(lists)=: * =member()=:

** Operatoren

Strukturen können in Operatorschreibweise geschrieben werden:

-  für Strukturen mit einer Komponente können Präfixoperatoren oder
   Postfixoperatoren definiert werden
-  für STrukturen mit 2 Komponenten können Infixoperatoren definiert
   werden

** Direktive

Begint mit =:-=. wird beim einlesen der Prolog Programms beachtetet.
Werden z.B. verwenden um die Bindungsstärke von Operatoren festzulegen.

** Beweisen von Aussagen in Prolog

-  /Fakten/: sind per Definition beweisbar. Fakten werden z.T. auch als
   "leere Regeln" betrachtet.
-  /(einfaches) Resolutionsprinzip/: Reduziere den Beweis einer /Regel/
   =L :- L1, ..., Ln= auf die Beweise von =L1=, ..., =Ln=
-  /Anfragen/: Anfragen sind beweisbar, wenn sie auf die "leere Anfrage"
   bzw. ein Faktum reduziert werden können

** Termersetzung

Eine /Substitution/ ist eine Abbildung (strukturerhaltende Abbildung,
Homomorphismus) $\sigma: Terme \rigtharrow Terme$ mit:

-  für aller Terme $f(t_1, ..., t_n)$ gilt
   $\sigma(f(t_1, ..., t_n)) = f(\sigma(t_1), ..., \sigma(t_n))$
-  endlciher Variablenmenge: $\{X | X \neq \sigma(X), X ist Variable$}

$\sigma$ ist eindeutig darstellbar:
$\{X \rightarrow \sigma(X) | \text{X ist Variable mit } X \neq \sigma(X)\}$

Ein Term ist eine Variable oder eine Struktur, die wieder Terme enthält.

** Unifikator

Eine Substitution $\sigma$ heißt /Unifikator für Terme/ $t_1$ und $t_2$,
falls $\sigma(t_1) = \sigma(t_2)$. Man sagt dann auch $t_1$ und $t_2$
sind /unifizierbar/.

$\sigma$ heißt allgemeinster Unifikator (engl. most general unifier;
MGU) für $t_1, t_2$, falls * $\sigma$ Unifikator für $t_1$ und $t_2$ ist
und * für alle anderen Unifikatoren $\sigma'$ existiert $\rho$ mit
$\sigma' = \rho \circ \sigma$, d.h.
$\forall t: \sigma'(t) = \rho(\sigma(t))$.

*** Eigenschaften

-  es existieren immer MGUs für unifizierbare Terme (Robinson, 1965).

