lang/prolog.html
---
layout: page
title: Prolog
---

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Prolog</h2>
<div class="outline-text-2" id="text-1">
<p>
Prolog ist eine dynamisch getypte Sprache. Prolog (dt. Programmieren in
Logik). Stadardisiert (ISO-)
</p>

<p>
Ein Prolog Programm ist eine Menge von <i>Fakten</i> und <i>Regeln</i> (auch
<i>Klauseln</i> genannt) für Prädikate, wobei Prädikate Aussagen über Objekte
sind. Eine Aussage besteht aus einer Beschreibung der Eigenschaft (z.B.
"ist Primzahl") und beteiligten <i>Objekten</i> (z.B. "3"). Aussage werden in
der <i>Standardpräfixschreibweise</i> angegeben, z.B.
<code>name(objekt1, ..., objektn)</code> (Leerzeichen vor der öffnenden Klammer
sind nicht zulässig).
</p>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Kommentare</h3>
<div class="outline-text-3" id="text-1-1">
<p>
<code>%</code>
</p>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Atome</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Atome sind unzerlegbare Prolog-Objekte. Atome beginnen mit einem
Kleinbuchstaben (danach sind weitere Kleinbuchstaben, Großbuchstaben,
Ziffern und einige Sonderzeichen zulässig).
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Vergleich von Atomen</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Gleichheit: <code>⟨atom⟩ =</code> ⟨atom⟩=
</li>
<li>Ungleichheit: <code>⟨atom⟩ \</code> ⟨atom⟩=
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Frei Variablen</h3>
<div class="outline-text-3" id="text-1-4">
<p>
<i>Frei Variablen</i> (auch <i>Logikvariablen</i>) sind Variablen, deren Werte
nach dem Schlussfolgerungsprinzip auf Basis der definierten Fakten
bestimmt werden. Freie Variablen beginnen mit einem Großbuchstaben und
können in Termen verwendet werden.
</p>
</div>
</div>

<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> Fakten</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Fakten sind Aussagen, die beweisbar sind, also zu "wahr" ausgewertet
werden. Sie werden mit <code>.</code> und einem Whitespace (Leereichen oder
Zeilenvorschub) abgeschlossen. Fakten haben die Form:
<code>⟨Prädikat⟩(⟨Term⟩).</code>
</p>
</div>
</div>

<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> Regeln</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Regeln sich Schlussfolgerungen der Form: "Wenn Aussage A wahr ist, dann
ist auch Aussage B wahr". Regeln werden ebenfalls mit <code>.</code> und einem
Whitespace (Leereichen oder Zeilenvorschub) abgeschlossen. <code>:-</code>
enspricht \(\Longleftarrow\). =,= entspricht \(\wedge\). <code>;</code> entspricht
\(\vee\). Regeln haben die Form: <code>⟨Term⟩ :- ⟨Term⟩, ..., ⟨Term⟩.</code>
</p>
</div>
</div>

<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> Anonyme Variable</h3>
<div class="outline-text-3" id="text-1-7">
<p>
<code>_</code> ist die <i>anonyme (freie) Variablen</i>. Sie wird nicht gebunden und
bezeichnet bei mehrfacher Verwendung nicht denselben Wert. ALso steht
<code>[_,_,_]</code> für alle 3-elementigen Listen, deren Elemente identisch sind
oder nicht.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Anfragen</h2>
<div class="outline-text-2" id="text-2">
<p>
In Anfragen können freie Variablen verwendet werden. Das Ergebnis von
Anfragen sind diejenigen <i>Objekte</i>, für die die Anfrage wahr wird. Die
Ausgabe einer Anfrage wird durch <code>false</code> oder <code>no</code> abgeschlossen.
</p>
</div>
</div>

<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Strukturen</h2>
<div class="outline-text-2" id="text-3">
<p>
Strukturen bestehen aus einem <i>Funktor</i> und <i>Komponenten</i> (beliebe
Prolog-Objekte).
</p>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Objekte</h2>
<div class="outline-text-2" id="text-4">
<p>
Objekte werden auch <i>Terme</i> genannt. Terme bestehen aus:
</p>

<ul class="org-ul">
<li>Konstanten (Zahlen oder Atome)
</li>
<li>Strukturen
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Listen</h2>
<div class="outline-text-2" id="text-5">
<ul class="org-ul">
<li>leere List: <code>[]</code>
</li>
<li><code>.</code> ist der Funktor zur Konstruktion einer Liste aus einem Element
und einer Restliste, z.B. <code>.(x,xs)</code>
</li>
</ul>

<p>
Kurzschreibweisen für Listen: * <code>[1,2,3]</code> * <code>[x|xs]</code>
</p>

<ul class="org-ul">
<li>Texte (Strings) sind Listen von ASCII-Werten (es gibt keinen Datentyp
für Character)
</li>
</ul>
</div>

<div id="outline-container-sec-5-0-1" class="outline-4">
<h4 id="sec-5-0-1"><span class="section-number-4">5.0.1</span> Vordefinierte Prädikate für Listen</h4>
<div class="outline-text-4" id="text-5-0-1">
<p>
Aus <code>library(lists)</code>: * <code>member()</code>:
</p>
</div>
</div>

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Operatoren</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Strukturen können in Operatorschreibweise geschrieben werden:
</p>

<ul class="org-ul">
<li>für Strukturen mit einer Komponente können Präfixoperatoren oder
Postfixoperatoren definiert werden
</li>
<li>für STrukturen mit 2 Komponenten können Infixoperatoren definiert
werden
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Direktive</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Begint mit <code>:-</code>. wird beim einlesen der Prolog Programms beachtetet.
Werden z.B. verwenden um die Bindungsstärke von Operatoren festzulegen.
</p>
</div>
</div>

<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> Beweisen von Aussagen in Prolog</h3>
<div class="outline-text-3" id="text-5-3">
<ul class="org-ul">
<li><i>Fakten</i>: sind per Definition beweisbar. Fakten werden z.T. auch als
"leere Regeln" betrachtet.
</li>
<li><i>(einfaches) Resolutionsprinzip</i>: Reduziere den Beweis einer <i>Regel</i>
   <code>L :- L1, ..., Ln</code> auf die Beweise von <code>L1</code>, &#x2026;, <code>Ln</code>
</li>
<li><i>Anfragen</i>: Anfragen sind beweisbar, wenn sie auf die "leere Anfrage"
bzw. ein Faktum reduziert werden können
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> Termersetzung</h3>
<div class="outline-text-3" id="text-5-4">
<p>
Eine <i>Substitution</i> ist eine Abbildung (strukturerhaltende Abbildung,
Homomorphismus) \(\sigma: Terme \rigtharrow Terme\) mit:
</p>

<ul class="org-ul">
<li>für aller Terme \(f(t_1, ..., t_n)\) gilt
\(\sigma(f(t_1, ..., t_n)) = f(\sigma(t_1), ..., \sigma(t_n))\)
</li>
<li>endlciher Variablenmenge: $\{X | X &ne; &sigma;(X), X ist Variable$}
</li>
</ul>

<p>
\(\sigma\) ist eindeutig darstellbar:
\(\{X \rightarrow \sigma(X) | \text{X ist Variable mit } X \neq \sigma(X)\}\)
</p>

<p>
Ein Term ist eine Variable oder eine Struktur, die wieder Terme enthält.
</p>
</div>
</div>

<div id="outline-container-sec-5-5" class="outline-3">
<h3 id="sec-5-5"><span class="section-number-3">5.5</span> Unifikator</h3>
<div class="outline-text-3" id="text-5-5">
<p>
Eine Substitution \(\sigma\) heißt <i>Unifikator für Terme</i> \(t_1\) und \(t_2\),
falls \(\sigma(t_1) = \sigma(t_2)\). Man sagt dann auch \(t_1\) und \(t_2\)
sind <i>unifizierbar</i>.
</p>

<p>
\(\sigma\) heißt allgemeinster Unifikator (engl. most general unifier;
MGU) für \(t_1, t_2\), falls * \(\sigma\) Unifikator für \(t_1\) und \(t_2\) ist
und * für alle anderen Unifikatoren \(\sigma'\) existiert \(\rho\) mit
\(\sigma' = \rho \circ \sigma\), d.h.
\(\forall t: \sigma'(t) = \rho(\sigma(t))\).
</p>
</div>

<div id="outline-container-sec-5-5-1" class="outline-4">
<h4 id="sec-5-5-1"><span class="section-number-4">5.5.1</span> Eigenschaften</h4>
<div class="outline-text-4" id="text-5-5-1">
<ul class="org-ul">
<li>es existieren immer MGUs für unifizierbare Terme (Robinson, 1965).
</li>
</ul>
</div>
</div>
