org/lang/prolog.org
** kombinatorische Constraints

-  =all_different(⟨Liste⟩)=: alle Variablen der Liste müssen
   unterschiedlich belegt sein.
-  =sum(⟨Variablenliste⟩, ⟨Relation⟩, ⟨Value⟩)=: Constraint für die
   Summe arithmetischer Variablen, z.B. =sum([A,B,C], #=, 10)=
-  =serialized=

* Metaprogrammierung

** Metaprädikat

-  =findall(⟨Variable/Format⟩, ⟨Term⟩, ⟨Ergebnisliste⟩)=: liefert /eine/
   Liste der möglichen Belegungen von =⟨Variable/Format⟩= in =⟨Term⟩=
-  =bagof(⟨Variable⟩, ⟨Term⟩, ⟨Ergebnisliste⟩)=: liefert für jede
   Belegung der freien Variablen in =⟨Term⟩= eine Liste der möglichen
   Belegungen von =⟨Variable⟩= in =⟨Term⟩=. Das Ergebnis ist eine
   Multimenge.
-  =setof(⟨Variable⟩, ⟨Term⟩, ⟨Ergebnisliste⟩)=: wie =bagof= aber mit
   Deduplizierung. Das Ergebnis ist eine Menge.

** Dynamsche Regeln

/Dynamische Regeln/ erlaube eine Veränderung der Wissensbasis
(Gesamtheit der Fakten und Regeln) zur Interpretationszeit.

Prädikate, die in einem Prolog-Programm definiert wurden, heißen
/statisch Prädikate/ (=static=). Um ein =static= Prädikat =p=
veränderbar zu machen, muss es als danamisch deklariert werden, mit der
Direktive =:- dynamic ⟨p⟩/⟨Stelligkeit von p⟩.=

-  =assert(⟨Regel⟩)=: füge der Wissensbasis eine neue Regel hinzu, z.B.
   =assert(p(c)).=
-  =asserta(⟨Regel⟩)=: füge eine dynamische Regel am Anfang der
   Wissensbasis hinzu
-  =assertb(⟨Regel⟩)=: füge eine dynamische Regel am Ende der
   Wissensbasis hinzu
-  =retract(⟨Regel⟩)=: entferne eine dynamische Regel

-  =clause(⟨P⟩,⟨Q⟩)= ist beweisbar, wenn die Regel =P :- Q= in der
   Wissenbasis ist (benutzerdefinierte Prädikat); für Fakten:
   =clause(⟨P⟩, true)=


