lang/prolog.html

<div id="outline-container-sec-10-3" class="outline-3">
<h3 id="sec-10-3"><span class="section-number-3">10.3</span> kombinatorische Constraints</h3>
<div class="outline-text-3" id="text-10-3">
<ul class="org-ul">
<li><code>all_different(⟨Liste⟩)</code>: alle Variablen der Liste müssen
unterschiedlich belegt sein.
</li>
<li><code>sum(⟨Variablenliste⟩, ⟨Relation⟩, ⟨Value⟩)</code>: Constraint für die
Summe arithmetischer Variablen, z.B. <code>sum([A,B,C], #</code>, 10)=
</li>
<li><code>serialized</code>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-11" class="outline-2">
<h2 id="sec-11"><span class="section-number-2">11</span> Metaprogrammierung</h2>
<div class="outline-text-2" id="text-11">
</div><div id="outline-container-sec-11-1" class="outline-3">
<h3 id="sec-11-1"><span class="section-number-3">11.1</span> Metaprädikat</h3>
<div class="outline-text-3" id="text-11-1">
<ul class="org-ul">
<li><code>findall(⟨Variable/Format⟩, ⟨Term⟩, ⟨Ergebnisliste⟩)</code>: liefert <i>eine</i>
   Liste der möglichen Belegungen von <code>⟨Variable/Format⟩</code> in <code>⟨Term⟩</code>
</li>
<li><code>bagof(⟨Variable⟩, ⟨Term⟩, ⟨Ergebnisliste⟩)</code>: liefert für jede
Belegung der freien Variablen in <code>⟨Term⟩</code> eine Liste der möglichen
Belegungen von <code>⟨Variable⟩</code> in <code>⟨Term⟩</code>. Das Ergebnis ist eine
Multimenge.
</li>
<li><code>setof(⟨Variable⟩, ⟨Term⟩, ⟨Ergebnisliste⟩)</code>: wie <code>bagof</code> aber mit
Deduplizierung. Das Ergebnis ist eine Menge.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-11-2" class="outline-3">
<h3 id="sec-11-2"><span class="section-number-3">11.2</span> Dynamsche Regeln</h3>
<div class="outline-text-3" id="text-11-2">
<p>
<i>Dynamische Regeln</i> erlaube eine Veränderung der Wissensbasis
(Gesamtheit der Fakten und Regeln) zur Interpretationszeit.
</p>

<p>
Prädikate, die in einem Prolog-Programm definiert wurden, heißen
<i>statisch Prädikate</i> (<code>static</code>). Um ein <code>static</code> Prädikat <code>p</code>
veränderbar zu machen, muss es als danamisch deklariert werden, mit der
Direktive <code>:- dynamic ⟨p⟩/⟨Stelligkeit von p⟩.</code>
</p>

<ul class="org-ul">
<li><code>assert(⟨Regel⟩)</code>: füge der Wissensbasis eine neue Regel hinzu, z.B.
<code>assert(p(c)).</code>
</li>
<li><code>asserta(⟨Regel⟩)</code>: füge eine dynamische Regel am Anfang der
Wissensbasis hinzu
</li>
<li><code>assertb(⟨Regel⟩)</code>: füge eine dynamische Regel am Ende der
Wissensbasis hinzu
</li>
<li><code>retract(⟨Regel⟩)</code>: entferne eine dynamische Regel
</li>

<li><code>clause(⟨P⟩,⟨Q⟩)</code> ist beweisbar, wenn die Regel <code>P :- Q</code> in der
Wissenbasis ist (benutzerdefinierte Prädikat); für Fakten:
<code>clause(⟨P⟩, true)</code>
</li>
</ul>
</div>
</div>
</div>
